app/controllers/client_workouts_controller.rb

SELECT "client_workouts".* FROM "client_workouts" WHERE (LOWER(client_name) LIKE '%shania aman%')
---
  def find
  	#@client_workouts = ClientWorkout.where(client_name: params[:search_string])
  	#@client_workouts = ClientWorkout.where("LOWER(client_name) = ?", params[:search_string])
  	@client_workouts = ClientWorkout.where("LOWER(client_name) LIKE ?", "%" + params[:search_string].downcase + "%")

SELECT "client_workouts".* FROM "client_workouts"
---
  def index
    @client_workouts = ClientWorkout.all

SELECT  "client_workouts".* FROM "client_workouts" WHERE "client_workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def client_info
 	 @client_workout = ClientWorkout.find(params[:id])

SELECT  "client_workouts".* FROM "client_workouts" WHERE "client_workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def trainer_info
 	 @client_workout = ClientWorkout.find(params[:id])

INSERT INTO "client_workouts" ("client_name", "trainer", "duration_mins", "date_of_workout", "paid_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client_workout = ClientWorkout.new(client_workout_params)

    respond_to do |format|
      if @client_workout.save

UPDATE "client_workouts" SET "client_name" = ?, "updated_at" = ? WHERE "client_workouts"."id" = ?  [["client_name", "Max Dirk"], ["updated_at", "2019-06-06 16:33:38.025930"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @client_workout.update(client_workout_params)

SELECT  "client_workouts".* FROM "client_workouts" WHERE "client_workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_client_workout
      @client_workout = ClientWorkout.find(params[:id])