app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE (LOWER(client_name) LIKE '%x%')
---
  def find
  	@clients = Client.where("LOWER(name) LIKE ?", "%" + params[:search_string].downcase + "%")

INSERT INTO "clients" ("name", "address", "curr_weight", "height", "gender", "email_add", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save