app/controllers/trainers_controller.rb

  def find
  	@trainers = Trainer.where("LOWER(name) LIKE ?", "%" + params[:search_string].downcase + "%")
---
SELECT "trainers".* FROM "trainers" WHERE (LOWER(name) LIKE '%zz%')

  def create
    @trainer = Trainer.new(trainer_params)

    respond_to do |format|
      if @trainer.save
---
INSERT INTO "trainers" ("name", "address", "curr_weight", "height", "gender", "email_add", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_trainer
      @trainer = Trainer.find(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]